#+TITLE: config.org

** org-capture
#+begin_src emacs-lisp :tangle yes
(after! org-capture
  (setq org-capture-templates
        '(
          ("d" "daily" entry
           (file+olp+datetree +org-daily-file)
           "* TODO %?\n%i\n%a" :prepend t)
          ("l" "life" entry
           (file+headline +org-life-file "Unfiled")
           "* %?\nCAPTURED: %U\n%i\n%a" :prepend t)
          ("t" "todo(life)" entry
           (file+headline +org-life-file "Unfiled")
           "* TODO %?\nCAPTURED: %U\n%i\n%a" :prepend t)
          ("j" "journal" entry
           (file+olp+datetree +org-journal-file)
           "* %U %?\n%i\n%a")
          ("r" "reflect" entry
           (file+olp+datetree +org-reflect-file)
           "* %U %?\n%i\n%a")
          )
        )
  )
#+end_src

#+RESULTS:
| d | daily | entry | (file+olp+datetree +org-daily-file) | * TODO %? |

** org-re-reveal
#+begin_src emacs-lisp :tangle yes
(use-package org-re-reveal
  :ensure t
  :config
  (setq org-re-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/"))
#+end_src

#+RESULTS:
: http://cdn.jsdelivr.net/reveal.js/3.0.0/

